/**
 * أولاً سنقوم بتحميل جميع الاعتماديات اللازمة لجافاسكريبت في هذا المشروع
 * والتي تشمل Vue ومكتبات أخرى. هذا نقطة انطلاق رائعة عند بناء تطبيقات الويب
 * القوية والمتينة باستخدام Vue و Laravel.
 */
require('./bootstrap');

import { createApp } from 'vue';

/**
 * بعد ذلك، سنقوم بإنشاء تطبيق Vue جديد. يمكنك من خلاله البدء في تسجيل المكونات
 * مع مثيل التطبيق حتى يكونوا جاهزين للاستخدام في صفحات تطبيقك. يتم تضمين مثال
 * لك للإشارة.
 */

const app = createApp({});

import ExampleComponent from './components/ExampleComponent.vue';
app.component('example-component', ExampleComponent);

/**
 * في النهاية، سنربط مثيل التطبيق بعنصر HTML يحمل "id" بقيمة "app".
 * يتم تضمين هذا العنصر مع نظام "المصادقة" الأساسي. وإلا، ستحتاج إلى إضافة
 * عنصر بنفسك.
 */

app.mount('#app');
